#include <stdio.h>
#include <locale.h>
#define n 16    // начальное количество игроков
double graf[n][n] = {
    //     G      E     Z     I     M     P     S     C     9     0     1     2     3     4     5     6
/*G*/   {    0, 0.75, 0.80, 0.70, 0.65, 0.95, 0.60, 0.50, 0.60, 0.85, 0.95, 0.45, 0.50, 0.70, 0.80, 0.55 },
/*E*/   { 0.25,    0, 0.15, 0.10, 0.20, 0.70, 0.25, 0.20, 0.40, 0.60, 0.80, 0.15, 0.30, 0.35, 0.35, 0.15 },
/*Z*/   { 0.20, 0.85,    0, 0.75, 0.50, 0.90, 0.45, 0.40, 0.30, 0.80, 0.90, 0.25, 0.35, 0.50, 0.55, 0.35 },
/*I*/   { 0.30, 0.90, 0.25,    0, 0.45, 0.80, 0.45, 0.35, 0.45, 0.75, 0.85, 0.20, 0.50, 0.40, 0.45, 0.25 },
/*M*/   { 0.35, 0.80, 0.50, 0.55,    0, 0.90, 0.50, 0.30, 0.35, 0.75, 0.85, 0.25, 0.45, 0.55, 0.50, 0.30 },
/*P*/   { 0.05, 0.30, 0.10, 0.20, 0.10,    0, 0.15, 0.05, 0.10, 0.50, 0.60, 0.05, 0.20, 0.15, 0.25, 0.05 },
/*S*/   { 0.40, 0.75, 0.55, 0.55, 0.50, 0.85,    0, 0.25, 0.55, 0.70, 0.90, 0.45, 0.55, 0.60, 0.65, 0.40 },
/*C*/   { 0.50, 0.80, 0.60, 0.65, 0.70, 0.95, 0.75,    0, 0.65, 0.90, 0.95, 0.55, 0.40, 0.75, 0.80, 0.45 },
/*9*/   { 0.40, 0.60, 0.70, 0.55, 0.65, 0.90, 0.45, 0.35,    0, 0.75, 0.80, 0.45, 0.35, 0.65, 0.70, 0.50 },
/*0*/   { 0.15, 0.40, 0.20, 0.25, 0.25, 0.50, 0.30, 0.10, 0.25,    0, 0.65, 0.30, 0.15, 0.30, 0.30, 0.20 },
/*1*/   { 0.05, 0.20, 0.10, 0.15, 0.15, 0.40, 0.10, 0.05, 0.20, 0.35,    0, 0.05, 0.05, 0.10, 0.15, 0.10 },
/*2*/   { 0.55, 0.85, 0.75, 0.80, 0.75, 0.95, 0.55, 0.45, 0.55, 0.70, 0.95,    0, 0.65, 0.85, 0.90, 0.40 },
/*3*/   { 0.50, 0.70, 0.65, 0.50, 0.55, 0.80, 0.45, 0.60, 0.65, 0.85, 0.95, 0.35,    0, 0.80, 0.85, 0.60 },
/*4*/   { 0.30, 0.65, 0.50, 0.60, 0.45, 0.85, 0.40, 0.25, 0.35, 0.70, 0.90, 0.15, 0.20,    0, 0.75, 0.40 },
/*5*/   { 0.20, 0.65, 0.45, 0.55, 0.50, 0.75, 0.35, 0.20, 0.30, 0.70, 0.85, 0.10, 0.15, 0.25,    0, 0.30 },
/*6*/   { 0.45, 0.85, 0.65, 0.75, 0.70, 0.95, 0.60, 0.55, 0.50, 0.80, 0.90, 0.60, 0.40, 0.60, 0.70,    0 } };

void swap (int *a, int *b) {        // поменять местами два значения
    int t = *a;
    *a = *b;
    *b = t;
}
void quick (int *a, int L, int R) { // сортировка quickSort
    int i=L, j=R, x=a[(L+R)/2];
    do {
        while ((i!=(L+R)/2) && (a[i] < x)) i++; // a[i] < x
        while ((j!=(L+R)/2) && (x < a[j])) j--; // x < a[j]
        if (i<=j) {
            if (i<j) swap(&a[i],&a[j]);
            i++;
            j--;
        }
    } while (i<=j);
    if (i<R) quick(a,i,R);
    if (L<j) quick(a,L,j);
}
int find (int *a, int beg, int end, int x) {    // поиск индекса нужного элемента
    int mid;                                    // только(!) для упорядоченных массивов
    mid = (beg+end)/2;
    if (x==a[mid]) return mid;
    if (x<a[mid]) find(a,beg,mid-1,x);
    else find(a,mid+1,end,x);
}
int perest3 (int *p) {              // сочетания из трёх по одному
    for (int i=1; i<3; i++) {  // *p - указатель на начальный элемент "сменного" массива
        if (p[i]>p[0]){
            swap(&p[i],&p[0]);
            return 1;
        }
    }
    return 0;
}
int bolshe_est (int *p, int x) {    // есть ли в массиве (4 элемента) число больше искомого
    for (int i=0; i<4; ++i) {         // возвращает это число, если да; 0 - нет
        if (p[i]>x) return p[i];
    }
    return 0;
}
int perest7 (int *p) {              // сочетания из 7 по 3
    int ch;                           // *p - указатель на начальный элемент "сменного" массива
    for (int k=2; k>=0; --k) {        // k - "перебор" на каждое из трёх мест
        for (int i=3; i<7; i++) {
            if (p[i]>p[k]) {
                swap(&p[i],&p[k]);
                for (int K=k; K<2; ++K) {
                    if ((ch=bolshe_est(p+3,p[K]))) {        // присваивание, правильно
                        swap(&p[K+1],&p[find(p,3,6,ch)]);   // если числа подряд, достаточно условия (p[K+1]!= p[K]+1)
                        quick (p,4,6);
                    }
                }
                return 1;
            }
        }
    }
    return 0;
}
int perest15 (int *p) {             // сочетания из 15 по 7
    for (int k=6; k>=0; --k) {         // k - "перебор" на каждое из семи мест
        for (int i=7; i<15; i++) {
            if (p[i]>p[k]) {
                swap(&p[i],&p[k]);
                for (int K=k; K<6; ++K) {
                    if (p[K+1] != p[K]+1) {
                        swap(&p[K+1],&p[find(p,7,14,p[K]+1)]);
                        quick (p,8,14);
                    }
                }
                return 1;
            }
        }
    }
    return 0;
}
int perestanovka (int *a) {         // перебирает смысловые перестановки для 16 игроков
    //      14-16              quick 14-16           10-12               quick 10-12             10-16
    if (perest3(a+n-3) || (quick (a,n-3,n-1), perest3(a+n/2+1)) || (quick (a,n/2+1,n/2+3), perest7(a+n/2+1))) return 1;
    quick(a,n/2,n-1);
    //       6-8                  quick 6-8             2-4             quick 2-4       2-7
    if (perest3(a+n/2-3) || (quick (a,n/2-3,n/2-1), perest3(a+1)) || (quick (a,1,3), perest7(a+1))) return 1;
    quick(a,0,n/2-1);
    if (perest15(a+1)) return 1;
    return 0;    // больше перестановок нет
}
double formula (int *rasklad, int place, int N) {   // изначально N - количество игроков; i в main = place
    if (N/2==1) {
        if (place%2==0) return graf[rasklad[place]-1][rasklad[place+1]-1];
        else return graf[rasklad[place]-1][rasklad[place-1]-1];
    }
    double summ=0;
    int koef = (place/N)*N;
    if (place%N < (N/2)) {
        for (int i=N/2+koef; i<N+koef; ++i)
            summ += formula(rasklad, i, N/2)*graf[rasklad[place]-1][rasklad[i]-1];
        return summ*formula(rasklad, place, N/2);
    }
    else {
        for (int i=koef; i<N/2+koef; ++i)
            summ += formula(rasklad, i, N/2)*graf[rasklad[place]-1][rasklad[i]-1];
        return summ*formula(rasklad, place, N/2);
    }
}

int main() {
    setlocale(LC_ALL, "Rus");
    int rasklad[n]={1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16}, t=0, del=25540515; // 1/25
    double srednee[n]={0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
    do {
        for (int i=0; i<n; ++i)
            srednee[rasklad[i]-1] += formula(rasklad,i,n);
        t++;
        if (t%del==0) printf ("Перестановок: %d, часть: %d\n", t, t/del);
    } while (perestanovka(rasklad)); // всего - 638 512 875

    printf ("Перестановок: %d\n", t);
    printf ("Средняя вероятность побед каждого участника (аналитически):\n");
    for (int i=0; i<n; i++) printf ("Участник %d: %f\n", i+1, srednee[i]/t);

return 0;
}
